## Plan for log_archive/sre_bot
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                       |
|--------|---------------------------------------------------------------------------------|
| add    | `aws_iam_policy.assume_sre_vulnerability_report`                                |
|        | `aws_iam_policy.sre_vulnerability_report_policy`                                |
|        | `aws_iam_role.sre_vulnerability_report`                                         |
|        | `aws_iam_role_policy_attachment.attach_list_accounts_in_sandbox`                |
|        | `aws_iam_role_policy_attachment.sre_vulnerability_report`                       |
|        | `module.OIDC_Roles.aws_iam_role.this[&quot;sre_vulnerability_report_github_action&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.assume_sre_vulnerability_report will be created
  + resource "aws_iam_policy" "assume_sre_vulnerability_report" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "sre_vulnerability_report_github_action"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::886481071419:role/sre_vulnerability_report",
                          + "arn:aws:iam::274536870005:role/sre_vulnerability_report",
                        ]
                      + Sid      = "AssumeSREVulnerabilityReportRoles"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.sre_vulnerability_report_policy will be created
  + resource "aws_iam_policy" "sre_vulnerability_report_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "sre_vulnerability_report_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "guardduty:ListDetectors",
                          + "guardduty:GetFindingsStatistics",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadGuardDuty"
                    },
                  + {
                      + Action   = "securityhub:GetFindings"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadSecurityHub"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.sre_vulnerability_report will be created
  + resource "aws_iam_role" "sre_vulnerability_report" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::283582579564:role/sre-vulnerability-report-github-action"
                        }
                      + Sid       = "AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre_vulnerability_report_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.attach_list_accounts_in_sandbox will be created
  + resource "aws_iam_role_policy_attachment" "attach_list_accounts_in_sandbox" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sre_vulnerability_report_github_action"
    }

  # aws_iam_role_policy_attachment.sre_vulnerability_report will be created
  + resource "aws_iam_role_policy_attachment" "sre_vulnerability_report" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sre_vulnerability_report_role"
    }

  # module.OIDC_Roles.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.OIDC_Roles.data.aws_iam_policy_document.assume_role_policy["sre_vulnerability_report_github_action"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + jsonencode({}),
        ]
    }

  # module.OIDC_Roles.data.aws_iam_policy_document.oidc_assume_role_policy["sre_vulnerability_report_github_action"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "oidc_assume_role_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:cds-snc/site-reliability-engineering:ref:refs/heads/main",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.OIDC_Roles.data.tls_certificate.thumprint will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "thumprint"  {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://token.actions.githubusercontent.com"
    }

  # module.OIDC_Roles.aws_iam_role.this["sre_vulnerability_report_github_action"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre_vulnerability_report_github_action"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.assume_sre_vulnerability_report"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
